Generate a random messy dataset for cleaning

In [291]:
# import pandas as pd
# import numpy as np
# import random

# np.random.seed(42)

# rows = 1100

# data = {
#     "ID": list(range(1, rows+1)) + [5, 10],  # duplicates
#     "FirstName": [
#         random.choice(["John", " john ", "JOHN", "Jane", "Jnae", None, "", "Khalid", " KHALID ", "Francyn"])
#         for _ in range(rows+2)
#     ],
#     "LastName": [
#         random.choice(["Wick", " wick ", "WICK", "Doe", "Deo", None, "", "Wahab", " WAHAB ", "Lannister"])
#         for _ in range(rows+2)
#     ],
#     "Age": [
#         random.choice([25, 30, 40, "35", " forty ", None, -5, 150, 172])
#         for _ in range(rows+2)
#     ],
#     "JoinDate": [
#         random.choice(["2020-01-01", "01/02/2020", "2020/03/05", None, "20200407", "07-04-2020", "11-03-2021", "2022/10/15"])
#         for _ in range(rows+2)
#     ],
#     "Salary": [
#         random.choice([50000, "60000", None, "NaN", 45000, "?", "70,000", " /", 75000, "75000"])
#         for _ in range(rows+2)
#     ],
#     "Department": [
#         random.choice(["Sales", "sales ", "SALES", "Engineering", "Eng.", None, "Finance", "Finances", "FIN"])
#         for _ in range(rows+2)
#     ],
#     "Notes": [
#         random.choice(["ok", "N/A", None, "???", "   ", "good employee", "needs_review", "Good", "No review", "Bad employee"])
#         for _ in range(rows+2)
#     ],
# }

# df = pd.DataFrame(data)

# file_path = "C:/Users/Rafael/Documents/GitHub/messy_dataset/messy_dataset.csv"
# df.to_csv(file_path, index=False, encoding="utf-8")

# file_path

Messy Data Clean Up Begins

In [292]:
# Importing the required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [293]:
# Loading the data into a dataframe
df = pd.read_csv('C:/Users/Rafael/Documents/GitHub/messy_dataset/messy_dataset.csv')
df_original = df.copy() # Keeps a copy of the initial dataset in memory
df.head()

   ID FirstName LastName  Age    JoinDate Salary   Department          Notes
0   1       NaN      Deo   35  01/02/2020  75000         Eng.   needs_review
1   2    Khalid   WAHAB   150  11-03-2021  75000          FIN             ok
2   3       NaN      Doe   -5  2020/03/05  60000  Engineering   Bad employee
3   4       NaN    Wahab  NaN  2020/03/05    NaN        SALES   Bad employee
4   5       NaN    wick    30         NaN      ?        SALES  good employee

Cleaning the Name Columns

In [294]:
# Checking the total number of each unique names available in the dataset. This shows that the names need to be standardized
df['FirstName'].value_counts()

FirstName
Khalid      132
John        123
Jnae        111
Francyn     105
 KHALID     104
Jane         99
 john        98
JOHN         94
Name: count, dtype: int64

In [295]:
df['LastName'].value_counts()

LastName
 wick        129
Wahab        126
 WAHAB       112
Deo          109
Lannister    108
Wick         104
WICK         102
Doe           97
Name: count, dtype: int64

In [296]:
# df['Name'] = df['Name'].str.strip() # Removing all the spaces in around the name

df['FirstName'] = df['FirstName'].str.strip('/_123. ') # This removes all the outlined items to be striped off of the column
df['LastName'] = df['LastName'].str.strip('/_123. ')

df['FirstName'] = df['FirstName'].str.lower().str.title() # Converts all the texts to Camel Cases
df['LastName'] = df['LastName'].str.lower().str.title()   # Converts all the texts to Camel Cases

In [297]:
df['FirstName'].value_counts()

FirstName
John       315
Khalid     236
Jnae       111
Francyn    105
Jane        99
Name: count, dtype: int64

In [298]:
df['LastName'].value_counts()

LastName
Wick         335
Wahab        238
Deo          109
Lannister    108
Doe           97
Name: count, dtype: int64

In [299]:
df[['FirstName', 'LastName']].value_counts()

FirstName  LastName
John       Wick         93
Khalid     Wick         77
John       Wahab        75
Khalid     Wahab        45
Jnae       Wick         37
John       Doe          34
           Deo          31
Jane       Wick         29
Francyn    Wick         26
Jnae       Wahab        26
Khalid     Deo          25
John       Lannister    24
Khalid     Lannister    23
Francyn    Wahab        23
Khalid     Doe          21
Jane       Wahab        21
           Lannister    17
Francyn    Deo          13
           Lannister    13
Jnae       Deo          11
Francyn    Doe          10
Jnae       Doe          10
Jane       Doe           9
           Deo           7
Jnae       Lannister     5
Name: count, dtype: int64

In [300]:
# Standardizing the names by replacing the incorrect ones with the correct ones

df['FirstName'] = df['FirstName'].replace({ \
                                        'john': 'John',
                                        'Jnae': 'Jane',
                                        'KHALID': 'Khalid',
                                        'Francyn': 'Francyn'
                                    })

df['LastName'] = df['LastName'].replace({ \
                                        'Deo': 'Doe'
                                    })

In [301]:
# Filling the Null names with empty values
cols_to_fill = ['FirstName', 'LastName']
df[cols_to_fill] = df[cols_to_fill].fillna('')

df.head(10)

   ID FirstName LastName  Age    JoinDate Salary   Department          Notes
0   1                Doe   35  01/02/2020  75000         Eng.   needs_review
1   2    Khalid    Wahab  150  11-03-2021  75000          FIN             ok
2   3                Doe   -5  2020/03/05  60000  Engineering   Bad employee
3   4              Wahab  NaN  2020/03/05    NaN        SALES   Bad employee
4   5               Wick   30         NaN      ?        SALES  good employee
5   6      John     Wick   40         NaN  50000         Eng.      No review
6   7    Khalid     Wick   25  2020-01-01  75000        Sales             ok
7   8      John     Wick  NaN  2020-01-01    NaN      Finance      No review
8   9      John    Wahab  150  2022/10/15  50000  Engineering           Good
9  10   Francyn     Wick  172  07-04-2020      ?          FIN            NaN

In [302]:
df['FirstName'].value_counts()

FirstName
John       315
           236
Khalid     236
Jane       210
Francyn    105
Name: count, dtype: int64

In [303]:
df['LastName'].value_counts()

LastName
Wick         335
Wahab        238
             215
Doe          206
Lannister    108
Name: count, dtype: int64

In [304]:
# Checking the number of missing values (NULL or NaN) in each column
df.isnull().sum()

ID              0
FirstName       0
LastName        0
Age           124
JoinDate      128
Salary        236
Department    114
Notes         214
dtype: int64

In [358]:
# Checking duplicates
df[df['ID'].duplicated(keep = False)] # Not decided on how to clean the duplicates on the ID column

Empty DataFrame
Columns: [ID, FirstName, LastName, Age, JoinDate, Salary, Department, Notes]
Index: []

In [306]:
# df = df.drop_duplicates(subset=['ID'], keep= 'first')

In [307]:
# Checking the number of missing values (NULL or NaN) in each column
df.isnull().sum()

ID              0
FirstName       0
LastName        0
Age           124
JoinDate      128
Salary        236
Department    114
Notes         214
dtype: int64

Cleaning the Age Column

In [308]:
# Checking the unique ages in the dataframe
df['Age'].value_counts()

Age
40         135
-5         132
25         129
 forty     124
150        118
172        116
35         114
30         110
Name: count, dtype: int64

In [309]:
df['Age'] = df['Age'].str.strip() # Removing all unwanted spaces around the ages (if there are any)
df['Age'] = df['Age'].replace('forty', 40) # Replacing the word forty with the number 40

In [310]:
df['Age'].value_counts()

Age
40     135
-5     132
25     129
40     124
150    118
172    116
35     114
30     110
Name: count, dtype: int64

In [311]:
# Convert the age column to integer. Int64 converts the column to nullable integers which keeps NaN and <NA>
df['Age'] = pd.to_numeric(df['Age']).astype('Int64')

In [312]:
# Filters the dataframe with only the valid ages and stores it back in the dataframe
df = df[(df['Age'] > 0) & (df['Age'] < 120)]

In [313]:
df.head(10)

    ID FirstName LastName  Age    JoinDate Salary   Department          Notes
0    1                Doe   35  01/02/2020  75000         Eng.   needs_review
4    5               Wick   30         NaN      ?        SALES  good employee
5    6      John     Wick   40         NaN  50000         Eng.      No review
6    7    Khalid     Wick   25  2020-01-01  75000        Sales             ok
12  13      John    Wahab   25  07-04-2020  75000          FIN   Bad employee
13  14      John     Wick   35         NaN  45000  Engineering
14  15      John            30  2020-01-01  50000          FIN  good employee
16  17      Jane     Wick   40         NaN    NaN  Engineering            ???
19  20      Jane     Wick   35  01/02/2020  60000        Sales           Good
23  24    Khalid     Wick   30  2020-01-01  60000      Finance      No review

Cleaning the Salary Column

In [314]:
df['Salary'].value_counts()

Salary
75000     130
50000      74
45000      62
60000      56
70,000     55
?          50
 /         43
Name: count, dtype: int64

In [315]:
df.isnull().sum() # Salary had 142 Null values here

ID              0
FirstName       0
LastName        0
Age             0
JoinDate       74
Salary        142
Department     53
Notes         119
dtype: int64

In [ ]:
df['Salary'] = df['Salary'].str.strip('?/, ') # Removing all unwanted characters around the values
# df['Salary'] = df['Salary'].replace({'?': '', ',': '', '/': '',' ': ''})
df['Salary'] = df['Salary'].str.replace(',', '') # Removing the comma from the salary values that are stored as strings
df['Salary'] = pd.to_numeric(df['Salary']).astype('Int64') # Converting the salary column to integer which also converts all invalid values to NULL or <NA>
df['Salary'].value_counts()

Salary
75000    130
50000     74
45000     62
60000     56
70000     55
Name: count, dtype: Int64

In [ ]:
df.isnull().sum() # Salary column now has 235 null values cos of this conversion "df['Salary'] = pd.to_numeric(df['Salary']).astype('Int64')"

ID              0
FirstName       0
LastName        0
Age             0
JoinDate       74
Salary        235
Department     53
Notes         119
dtype: int64

In [318]:
# Filling all the Missing values with the floor of the average salaries
df['Salary'] = df['Salary'].fillna((df['Salary'].mean() // 1000) * 1000)

In [319]:
df['Salary']

0       75000
4       62000
5       50000
6       75000
12      75000
        ...
1092    50000
1094    60000
1095    62000
1097    62000
1099    50000
Name: Salary, Length: 612, dtype: Int64

In [320]:
df.isnull().sum()

ID              0
FirstName       0
LastName        0
Age             0
JoinDate       74
Salary          0
Department     53
Notes         119
dtype: int64

In [321]:
df.head(10)

    ID FirstName LastName  Age    JoinDate  Salary   Department          Notes
0    1                Doe   35  01/02/2020   75000         Eng.   needs_review
4    5               Wick   30         NaN   62000        SALES  good employee
5    6      John     Wick   40         NaN   50000         Eng.      No review
6    7    Khalid     Wick   25  2020-01-01   75000        Sales             ok
12  13      John    Wahab   25  07-04-2020   75000          FIN   Bad employee
13  14      John     Wick   35         NaN   45000  Engineering
14  15      John            30  2020-01-01   50000          FIN  good employee
16  17      Jane     Wick   40         NaN   62000  Engineering            ???
19  20      Jane     Wick   35  01/02/2020   60000        Sales           Good
23  24    Khalid     Wick   30  2020-01-01   60000      Finance      No review

Cleaning the Date Column

In [322]:
# df['JoinDate']
# pd.to_datetime(df['JoinDate'], errors = 'coerce', infer_datetime_format= True)
# pd.to_datetime(df['JoinDate'].astype(str), errors='coerce')

# pd.to_datetime(
#     df['JoinDate'].astype(str).str.replace('[^0-9/]', '', regex=True),  # remove unwanted chars
#     format=None,  # let pandas infer format
#     errors='coerce',  # invalid ones become NaT
# )

df['JoinDate'] = pd.to_datetime(df['JoinDate'], format= 'mixed') # Worked effectively because of the new pandas format='mixed' that handles all mixed date formats properly
df['JoinDate'] = df['JoinDate'].ffill() # (Forward Fill) Fills the NULL values with the value of the previous record (bfill() for backward fill)

In [323]:
df.isnull().sum()

ID              0
FirstName       0
LastName        0
Age             0
JoinDate        0
Salary          0
Department     53
Notes         119
dtype: int64

In [324]:
df.head(10)

    ID FirstName LastName  Age   JoinDate  Salary   Department          Notes
0    1                Doe   35 2020-01-02   75000         Eng.   needs_review
4    5               Wick   30 2020-01-02   62000        SALES  good employee
5    6      John     Wick   40 2020-01-02   50000         Eng.      No review
6    7    Khalid     Wick   25 2020-01-01   75000        Sales             ok
12  13      John    Wahab   25 2020-07-04   75000          FIN   Bad employee
13  14      John     Wick   35 2020-07-04   45000  Engineering
14  15      John            30 2020-01-01   50000          FIN  good employee
16  17      Jane     Wick   40 2020-01-01   62000  Engineering            ???
19  20      Jane     Wick   35 2020-01-02   60000        Sales           Good
23  24    Khalid     Wick   30 2020-01-01   60000      Finance      No review

Cleaning The Departments Column

In [325]:
df['Department'].value_counts()

Department
SALES          84
Sales          75
FIN            74
Eng.           72
Finance        70
Finances       69
sales          65
Engineering    50
Name: count, dtype: int64

In [326]:
df['Department'] = df['Department'].str.strip('. ')
df['Department'] = df['Department'].str.lower().str.title() # First make everything lower case, before converting them to Camel Case
df['Department'] = df['Department'].replace(
    {
        'Eng': 'Engineering',
        'FIN': 'Finance',
        'Fin': 'Finance'
    })

df['Department'].value_counts()

Department
Sales          224
Finance        144
Engineering    122
Finances        69
Name: count, dtype: int64

In [327]:
df['Department'].isnull().sum()

53

In [328]:
df['Department'] = df['Department'].fillna('Unknown')

In [329]:
df.isnull().sum()

ID              0
FirstName       0
LastName        0
Age             0
JoinDate        0
Salary          0
Department      0
Notes         119
dtype: int64

In [330]:
df.isnull().sum()

ID              0
FirstName       0
LastName        0
Age             0
JoinDate        0
Salary          0
Department      0
Notes         119
dtype: int64

Cleaning The Notes Column

In [331]:
df['Notes'].value_counts()

Notes
                 70
Bad employee     64
needs_review     63
???              62
Good             62
good employee    61
No review        56
ok               55
Name: count, dtype: int64

In [ ]:
df['Notes'] = df['Notes'].astype('str')
df['Notes'] = df['Notes'].str.strip('???, ')

df['Notes'] = df['Notes'].replace('', 'No Review')
df['Notes'] = df['Notes'].replace('No review', 'No Review')
df['Notes'] = df['Notes'].replace('Good', 'Good Employee')
df['Notes'] = df['Notes'].replace('Nan', 'No Review')


df['Notes'] = df['Notes'].str.lower().str.title()
df['Notes'] = df['Notes'].fillna('No Review')

df['Notes'].value_counts()

Notes
No Review        307
Good Employee    123
Bad Employee      64
Needs_Review      63
Ok                55
Name: count, dtype: int64

In [353]:
df.isnull().sum()

ID            0
FirstName     0
LastName      0
Age           0
JoinDate      0
Salary        0
Department    0
Notes         0
dtype: int64

In [357]:
df[df['ID'].duplicated()]

Empty DataFrame
Columns: [ID, FirstName, LastName, Age, JoinDate, Salary, Department, Notes]
Index: []

In [359]:
df

,ID,FirstName,LastName,Age,JoinDate,Salary,Department,Notes
0,1,,Doe,35,2020-01-02,75000,Engineering,Needs_Review
4,5,,Wick,30,2020-01-02,62000,Sales,Good Employee
5,6,John,Wick,40,2020-01-02,50000,Engineering,No Review
6,7,Khalid,Wick,25,2020-01-01,75000,Sales,Ok
12,13,John,Wahab,25,2020-07-04,75000,Finance,Bad Employee
...,...,...,...,...,...,...,...,...
1092,1093,Jane,Wick,30,2020-07-04,50000,Sales,No Review
1094,1095,John,Wick,25,2020-07-04,60000,Sales,Ok
1095,1096,,Wahab,30,2020-03-05,62000,Finances,Good Employee
1097,1098,Jane,Lannister,40,2020-01-02,62000,Sales,No Review
1099,1100,Khalid,Wick,40,2020-01-02,50000,Finance,No Review

In [361]:
# Drop the original index and reset the index so that it is properly aligned
df = df.reset_index(drop= True)

In [362]:
df

,ID,FirstName,LastName,Age,JoinDate,Salary,Department,Notes
0,1,,Doe,35,2020-01-02,75000,Engineering,Needs_Review
1,5,,Wick,30,2020-01-02,62000,Sales,Good Employee
2,6,John,Wick,40,2020-01-02,50000,Engineering,No Review
3,7,Khalid,Wick,25,2020-01-01,75000,Sales,Ok
4,13,John,Wahab,25,2020-07-04,75000,Finance,Bad Employee
...,...,...,...,...,...,...,...,...
607,1093,Jane,Wick,30,2020-07-04,50000,Sales,No Review
608,1095,John,Wick,25,2020-07-04,60000,Sales,Ok
609,1096,,Wahab,30,2020-03-05,62000,Finances,Good Employee
610,1098,Jane,Lannister,40,2020-01-02,62000,Sales,No Review
611,1100,Khalid,Wick,40,2020-01-02,50000,Finance,No Review

In [363]:
df.to_csv('C:/Users/Rafael/Documents/GitHub/messy_dataset/messy_dataset_cleaned.csv', index=False, encoding='UTF-8')